app/controllers/figures_controller.rb

	def index
		@figures = Figure.all
---
SELECT "figures".* FROM "figures"

	def create
		@figure = Figure.new(figure_params)
		if @figure.save
---
INSERT INTO "figures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Paralelogramo"], ["description", "rectangulo"], ["created_at", "2019-07-05 22:08:26.033898"], ["updated_at", "2019-07-05 22:08:26.033898"]]

	def edit
		@figure = Figure.find(params[:id])
---
SELECT  "figures".* FROM "figures" WHERE "figures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@figure = Figure.find(params[:id])
		if @figure.update(figure_params)
---
SELECT  "figures".* FROM "figures" WHERE "figures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "figures" SET "description" = ?, "updated_at" = ? WHERE "figures"."id" = ?  [["description", "Isoceles"], ["updated_at", "2019-07-06 01:01:20.380691"], ["id", 2]]

	def destroy
		@figure = Figure.find(params[:id])
		@figure.destroy
---
SELECT  "figures".* FROM "figures" WHERE "figures"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "figures" WHERE "figures"."id" = ?  [["id", 5]]