app/controllers/pictures_controller.rb

	def new
		@picture = Picture.new
		@figure = Figure.all
		options=[]
		cont=1
		@figure.each do |f|
---
SELECT "figures".* FROM "figures"

	def create
		@picture = Picture.new(picture_params)
		if @picture.save
---
INSERT INTO "pictures" ("name", "sides", "description", "created_at", "updated_at", "color_selection", "kind_selection") VALUES (?, ?, ?, ?, ?, ?, ?)